<?php
echo '<pre>'; 
var_dump($_POST);
print_r($_POST); 
echo '</pre>';






if($var == 'Whatever') {

} else if($var == 'Something Else') {

}


















































































//  $info = "Привет: $_POST['name']. Твоя фамилия: $_POST['surname']. Твоя почта: $_POST['email']. Твой пароль: $_POST['password']";


// echo 'Из двух строк ' . 'делаем одну большую';
// $str = "Ваше фио: ";
// $num = $_POST['name']. $_POST['surname'];
 
// echo $str . $num . '<br>';
// echo 'Число: ' . 1;







// $name = 'Benjamin'; 
// $bar = "Привет, $name";
// echo $bar;  


// $testarr = [
    
//     'name' => '2',
//     'email' => 'value3',
//     'password' => 'value4'
    
// ];
// $testarr['name'];

// // $_POST переменная - это массив. Только ты его заполняешь при отправки формы. смотри.
// array {
//   ["name"]=>
//   string(12) "Вениамин"
//   ["number"]=>

  
// } 
// $array = array(
//     "name" => "Вениамин",
//     "surname" => "Елсуков"
//     "email" => "123123",
//     "password" => "123"

// );

// 
// 
// Array    // Это обозначает тип данных. Array - переводится как массив.
// (
// // Ключ     // Значение
    // [name] => fdfdfdf
    // [email] => 123123
// )
// 
// Так, смотри и запоминай.
// 
// Первый и второй - это одинаковые . просто я их в разном формате распечатал
// Смотри сейчас на второй.
// 
// К массивы ты должен обращаться по ключу. Т.е то, что слева. 
// 
// Например, создадим массив 
// 

// Добавлять сюда. 
// $testarr = [
//     'key1' => 'value1',
//     'key2' => 'value2',
//     'key3' => 'value3',
//     'key4' => 'value4',
//     'key5' => 'value5'
// ];
// $testarr['key4'];
// Заккоментируй тут ещё, плз
// Массив из 3х ключей. 
// Теперь мне нужен только второй Ключ
// Как обратиться к этому массиву?
// 
// Писать тут ↓
// 
// [key2] та
// 
// Почти. 
// Во-первых, тебе нужно указать название переменной, где хранится массив. 
// 
// $testarr;
// 
// Во вторых, уже указать ключ. Ключ всегда пишется в кавычках, если это строка. не в кавычках можно писать только цифры
// 
// $testarr['key2'];
// 
// Понятно? Теперь напиши массив с 3 ключом. Кстати, чтобы вернуть назад = это ctrl+z. Вперёд - ctrl+y. 
// 
// тип также,ток с кей3? Не говори, просто напиши.
// 
// $testarr['key3']; 
// $testarr['key4']; ???
// окей. Добавиь теперь в массив ещё два ключа и обратись к четвёртому ключу.
// 
// Молодец. Теперь давай ещё одно правило сделаем. 
// Просто обычный текст в php - это комментарии
// ВОт то, что я пишу, это по сути - коммент. 
// только ВОТ компьютер не понимает и ему надо это объяснить. Блин, тут лицуха нужна. Облом. 
// КОроче, вот ак выглядит комментарий
// ВОт это комментарий.

// У меня тут горячиее клавиши не работают. 
// Ты понял, как делать коммент? Заккоментирй эти строчки. 
// Кстати, ты можешь простто выделить этот текст и нажать ctrl+?
// Попробуй

// ОО, красава) Тепероь ты умеешь писать комментарии)))
// Понял? Теперь домашнее задание:

/**
 * 1. Сделать форму со следующими полями:
 * Имя
 * Фамилия
 * Почта
 * Пароль
 * 
 * Пароль при вводе должен показывать звёздочки. Это специальный type. в инпуте. Потом загуглишь
 * 
 * 2. Создать одну переменную, наподобии той, что я тогда делал, вот пример:
 * $test = "Ваше число: $_POST['number']. Ваше имя: $_POST['name']";
 * 
 * 3. Вывод должен быть такой: 
 * Привет, ИМЯ, ФАМИЛИЯ. Твоя почта: ПОЧТА. Твой самый секретный пароль: ПАРОЛЬ. 
 * 
 * Как-то так. Понял?
 * Ну всё, успехов. Кстати, когда после сохранения файла обновляешь браузер - обновляй через ctrl+f5. Он полностью очистит кеш. 
 * 
 */


?>